{
  "backend/main.mo": "Minimal Motoko actor with no methods defined.",
  "feature_evidence.json": "Feature evidence report listing music-related enhancements, affected files, and components for build planning.",
  "frontend-file-summaries.txt": "Pre-generated summaries describing the purpose of each frontend file for reference.",
  "frontend/index.css": "Global Tailwind-based styles defining Valentine-themed color variables and base layout rules.",
  "frontend/index.html": "HTML entry point setting metadata, fonts, and mounting the React app.",
  "frontend/src/App.tsx": "Main app component assembling sections, global music provider, persistent music controls, and the question journey overlay.",
  "frontend/src/components/effects/ConfettiEffect.tsx": "Canvas-like confetti animation using absolutely positioned DOM particles and requestAnimationFrame.",
  "frontend/src/components/effects/FloatingHeartsEffect.tsx": "Animated floating heart particles rendered via DOM updates and requestAnimationFrame.",
  "frontend/src/components/effects/HeartExplosionEffect.tsx": "Creates and animates a burst of heart-shaped particles using manual DOM updates and requestAnimationFrame.",
  "frontend/src/components/effects/SparklesEffect.tsx": "Generates looping sparkle animations across the screen by updating positioned divs each frame.",
  "frontend/src/components/Footer.tsx": "Footer displaying year, heart icons, and a tracked link to caffeine.ai.",
  "frontend/src/components/music/BackgroundMusicProvider.tsx": "Provides a global audio context for looping background music with controls for play, mute, pause, and resume.",
  "frontend/src/components/music/PersistentMusicControls.tsx": "Displays floating music controls that allow resuming blocked audio and toggling mute state.",
  "frontend/src/components/music/useBackgroundMusicContext.ts": "Custom hook that retrieves the background music context and enforces provider usage.",
  "frontend/src/components/sections/HeroSection.tsx": "Renders the main hero section with animated hearts, text content, a countdown, and a button that triggers a WhatsApp message.",
  "frontend/src/components/sections/LoveLetterSection.tsx": "Shows a styled love‑letter card containing title, body text, and signature from valentineContent.",
  "frontend/src/components/sections/MemoriesSection.tsx": "Empty placeholder file with no implemented content.",
  "frontend/src/components/sections/QuestionJourneySection.tsx": "Implements an interactive step‑based question journey with moving buttons, music integration, visual effects, and a celebration sequence.",
  "frontend/src/components/sections/ReasonsSection.tsx": "Displays a grid of cards listing reasons for love, each animated and sourced from valentineContent.",
  "frontend/src/components/ValentinesCountdown.tsx": "Countdown component showing time until Valentine's Day or a celebration message.",
  "frontend/src/content/valentineContent.ts": "Contains all static Valentine’s Day text content including hero text, love letter, reasons list, and question flow.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor using Internet Identity with React Query and invalidates dependent queries on identity changes.",
  "frontend/src/hooks/useBackgroundMusic.ts": "Provides a hook to control background audio playback, including play, pause, mute, and handling autoplay restrictions.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity provider and hook handling authentication, identity loading, login, and state management.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file exporting nothing, reserved for future backend query hooks.",
  "frontend/src/hooks/useValentinesCountdown.ts": "Tracks a live countdown to the next Valentine’s Day and flags when the day is being celebrated.",
  "frontend/src/index.css": "Defines global styles, Tailwind layers, fonts, color variables, and custom animation utilities for the site.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider and renders the root component.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, fonts, animations, container settings, and plugin integrations.",
  "project_state.json": "Defines current project state with existing features, a pending request, and metadata for implementing global background music and controls. Lists four implemented features and one new feature request."
}