{
  "backend/main.mo": "Minimal Motoko actor with no logic.",
  "feature_evidence.json": "Feature evidence report listing two heart‑animation features and their associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of all major frontend files including sections, effects, hooks, and config.",
  "frontend/index.css": "Tailwind base and theme variables defining OKLCH Valentine color tokens and global styles.",
  "frontend/index.html": "HTML entry point loading fonts, meta tags, and the React root with main.tsx.",
  "frontend/src/App.tsx": "Main React app composing hero, CTA, letter, reasons, footer, and optionally the question journey overlay.",
  "frontend/src/components/effects/ConfettiEffect.tsx": "DOM‑driven confetti animation generating particles with gravity, rotation, and continuous rendering.",
  "frontend/src/components/effects/FloatingHeartsEffect.tsx": "Floating and burst‑mode heart particle animation supporting origin‑based bursts and GPU‑accelerated transforms.",
  "frontend/src/components/effects/HeartExplosionEffect.tsx": "Creates a burst of animated heart particles using manual DOM updates and requestAnimationFrame. Handles particle physics, fading, and cleanup.",
  "frontend/src/components/effects/SparklesEffect.tsx": "Generates looping sparkle animations positioned randomly across the screen using timed opacity changes. Renders sparkles via innerHTML on each animation frame.",
  "frontend/src/components/Footer.tsx": "Footer showing year, heart icons, and a referral link to caffeine.ai.",
  "frontend/src/components/sections/HeroSection.tsx": "Displays the main hero area with headline content, countdown, and a WhatsApp redirect button. Triggers floating heart effects based on button position.",
  "frontend/src/components/sections/LoveLetterSection.tsx": "Renders a styled love letter card using content from valentineContent. Shows title, body text, and signature with decorative layout.",
  "frontend/src/components/sections/MemoriesSection.tsx": "Empty placeholder file for a future Memories section.",
  "frontend/src/components/sections/QuestionJourneySection.tsx": "Implements an interactive multi-step question flow with music, animated effects, and playful 'No' button behavior. Triggers celebration animations and final reveal on completion.",
  "frontend/src/components/sections/ReasonsSection.tsx": "Displays a grid of 'Reasons I Love You' cards with icons and animations sourced from valentineContent. Includes a decorative header and responsive layout.",
  "frontend/src/components/ValentinesCountdown.tsx": "Countdown component showing time until Valentine's Day or a celebration message.",
  "frontend/src/content/valentineContent.ts": "Holds all Valentine’s Day content such as hero text, love letter, reasons list, and question journey configuration. Centralizes customizable text and media paths.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor using React Query. Recreates the actor and invalidates dependent queries when identity changes.",
  "frontend/src/hooks/useBackgroundMusic.ts": "Custom hook for loading, playing, pausing, and muting looping background audio with playback-block detection. Manages internal audio element lifecycle and state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and provider for Internet Identity authentication, handling identity loading, login, error states, and access via a custom hook.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file for future React Query hooks with no current functionality.",
  "frontend/src/hooks/useValentinesCountdown.ts": "Implements a countdown hook that calculates time remaining until the next Valentine's Day and flags when the day is being celebrated.",
  "frontend/src/index.css": "Defines Tailwind base styles, color variables, romantic theme styling, animations, and typography for the site's visual design.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider before rendering.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, fonts, animations, container settings, and plugins for the site's styling system.",
  "project_state.json": "Stores project metadata, requirements, known issues, and architectural notes for the Valentine’s website build."
}